Repository: lingxi-coder/lingxi-app
Catalog: clients/ios/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko, zh_hant

# local_apps_workflow_validation_failed
source: 校验失败
en: Validation Failed
ja: 検証失敗
ko: 검증 실패
zh_hant: 校驗失敗

# local_apps_workspace
source: 工作区
en: Workspace
ja: ワークスペース
ko: 작업 공간
zh_hant: 工作區

# local_apps_workspace_open_failed_title
source: 无法打开工作区
en: Couldn't open the workspace
ja: ワークスペースを開けません
ko: 작업 공간을 열 수 없습니다
zh_hant: 無法開啟工作區

# local_apps_workspace_path_invalid
source: 工作区路径无效。
en: The workspace path is invalid.
ja: ワークスペースのパスが無効です。
ko: 작업 공간 경로가 유효하지 않습니다.
zh_hant: 工作區路徑無效。

# mcp_add_server
source: 添加 MCP 服务器
en: Add MCP Server
ja: MCP サーバーを追加
ko: MCP 서버 추가
zh_hant: 新增 MCP 伺服器

# mcp_auth
source: 鉴权
en: Authentication
ja: 認証
ko: 인증
zh_hant: 驗證

# mcp_auto_start
source: 自动启动
en: Auto-Start
ja: 自動起動
ko: 자동 시작
zh_hant: 自動啟動

# mcp_description_blurb
source: MCP (Model Context Protocol) 是连接外部工具的开放协议。已连接的服务器会向 AI 暴露工具调用能力。
en: MCP (Model Context Protocol) is an open protocol for connecting external tools. Connected servers expose tool-calling capabilities to the AI.
ja: MCP（Model Context Protocol）は外部ツールと接続するためのオープンプロトコルです。接続済みのサーバーは AI にツール呼び出し機能を提供します。
ko: MCP(Model Context Protocol)는 외부 도구를 연결하는 개방형 프로토콜입니다. 연결된 서버는 AI에 도구 호출 기능을 제공합니다.
zh_hant: MCP (Model Context Protocol) 是連線外部工具的開放協議。已連線的伺服器會向 AI 暴露工具呼叫能力。

# mcp_edit_status_tools_available %@ %lld
source: %@ · %lld 工具可用
en: %@ · %lld tools available
ja: %@ · ツール %lld 個利用可能
ko: %@ · 도구 %lld개 사용 가능

# mcp_edit_status_tools_fmt
source: %1$s · %2$d 工具可用
en: %1$s · %2$d tools available
ja: %1$s · ツール %2$d 個利用可能
ko: %1$s · 도구 %2$d개 사용 가능

# mcp_enable_server
source: 启用服务器
en: Enable Server
ja: サーバーを有効化
ko: 서버 활성화
zh_hant: 啟用伺服器

# mcp_endpoint
source: 端点
en: Endpoint
ja: エンドポイント
ko: 엔드포인트
zh_hant: 端點

# mcp_endpoint_hint
source: 支持 `stdio://`、`https://`、`sse://`
en: Supports `stdio://`, `https://`, `sse://`
ja: `stdio://`、`https://`、`sse://` に対応
ko: `stdio://`, `https://`, `sse://`를 지원합니다
zh_hant: 支援 `stdio://`、`https://`、`sse://`

# mcp_reconnect
source: 重新连接
en: Reconnect
ja: 再接続
ko: 다시 연결
zh_hant: 重新連線

# mcp_remove_server
source: 移除此服务器
en: Remove This Server
ja: このサーバーを削除
ko: 이 서버 제거
zh_hant: 移除此伺服器

# mcp_section_servers_count %lld
source: 服务器 · %lld
en: Servers · %lld
ja: サーバー · %lld
ko: 서버 · %lld
zh_hant: 伺服器 · %lld

# mcp_section_servers_fmt
source: 服务器 · %1$d
en: Servers · %1$d
ja: サーバー · %1$d
ko: 서버 · %1$d
zh_hant: 伺服器 · %1$d

# mcp_section_tool_permissions
source: 工具权限
en: Tool Permissions
ja: ツール権限
ko: 도구 권한
zh_hant: 工具權限

# mcp_section_transport_auth
source: 传输与鉴权
en: Transport & Authentication
ja: 転送と認証
ko: 전송 및 인증
zh_hant: 傳輸與驗證

# mcp_server_status_tools_detail %@ %lld %@
source: %@ · %lld 工具 · %@
en: %@ · %lld tools · %@
ja: %@ · ツール %lld 個 · %@
ko: %@ · 도구 %lld개 · %@

# mcp_server_status_tools_fmt
source: %1$s · %2$d 工具 · %3$s
en: %1$s · %2$d tools · %3$s
ja: %1$s · ツール %2$d 個 · %3$s
ko: %1$s · 도구 %2$d개 · %3$s

# mcp_stat_available_tools
source: 可用工具
en: Available Tools
ja: 利用可能なツール
ko: 사용 가능한 도구

# mcp_stat_connected
source: 已连接
en: Connected
ja: 接続済み
ko: 연결됨
zh_hant: 已連線

# mcp_tool_permissions_footer
source: 灵犀只会调用你允许的工具。每次首次调用会请求确认。
en: Lingxi only calls the tools you allow. You'll be asked to confirm the first time each one is used.
ja: 灵犀は許可したツールのみを呼び出します。初回呼び出し時には必ず確認を求めます。
ko: 灵犀는 허용한 도구만 호출합니다. 처음 호출할 때마다 확인을 요청합니다.
zh_hant: 靈犀只會呼叫你允許的工具。每次首次呼叫會請求確認。

# mcp_tool_readonly
source: 只读
en: Read-only
ja: 読み取り専用
ko: 읽기 전용
zh_hant: 只讀

# mcp_tool_writable
source: 可写
en: Writable
ja: 書き込み可能
ko: 쓰기 가능
zh_hant: 可寫

# mcp_transport_description_prefix
source: 支持 stdio / SSE / Streamable HTTP 三种传输；OAuth、API Key、本地子进程多种鉴权。 浏览公开服务器目录：
en: Supports stdio, SSE, and Streamable HTTP transports, with OAuth, API key, and local subprocess authentication. Browse the public server directory:
ja: stdio / SSE / Streamable HTTP の3種類の転送方式に対応し、OAuth・API Key・ローカルサブプロセスなど複数の認証方式に対応しています。 公開サーバーディレクトリを見る：
ko: stdio / SSE / Streamable HTTP 세 가지 전송 방식을 지원하며, OAuth · API Key · 로컬 서브프로세스 등 다양한 인증 방식을 지원합니다. 공개 서버 디렉터리 둘러보기:
zh_hant: 支援 stdio / SSE / Streamable HTTP 三種傳輸；OAuth、API Key、本地子行程多種驗證。 瀏覽公開伺服器目錄：

# mcp_transport_mode
source: 传输方式
en: Transport
ja: 転送方式
ko: 전송 방식
zh_hant: 傳輸方式

# onboarding_assistant_subtitle
source: 这是助手在界面和对话中的称呼，之后可以随时在设置中修改。
en: This is what the assistant will be called in the UI and conversation — you can change it anytime in Settings.
ja: これはアシスタントが画面や会話の中で使う呼び名です。後から設定でいつでも変更できます。
ko: 어시스턴트를 화면과 대화에서 부를 이름이며, 나중에 설정에서 언제든 바꿀 수 있습니다.
zh_hant: 這是助手在介面和對話中的稱呼，之後可以隨時在設定中修改。

# onboarding_assistant_title
source: 给你的灵犀起个名字
en: Give Your Lingxi a Name
ja: あなたの灵犀に名前をつけましょう
ko: 灵犀에게 이름을 지어주세요
zh_hant: 給你的靈犀起個名字

# onboarding_assistant_wake_hint
source: 这会成为它的唤醒词。之后你可以说「嘿，%1$s」随时唤醒它。
en: This will become its wake word. Afterward you can say “Hey, %1$s” anytime to wake it.
ja: これがウェイクワードになります。今後は「ねえ、%1$s」と話しかけると、いつでも呼び出せます。
ko: 이것이 호출어가 됩니다. 이후 "헤이, %1$s"라고 말하면 언제든 깨울 수 있습니다.
zh_hant: 這會成為它的喚醒詞。之後你可以說「嘿，%1$s」隨時喚醒它。

# onboarding_back
source: 返回
en: Back
ja: 戻る
ko: 뒤로

# onboarding_cta_continue
source: 继续
en: Continue
ja: 続ける
ko: 계속
zh_hant: 繼續

# onboarding_cta_finish
source: 进入灵犀
en: Enter Lingxi
ja: 灵犀を始める
ko: 灵犀 시작하기
zh_hant: 進入靈犀

# onboarding_cta_start
source: 开始设置
en: Start Setup
ja: セットアップを開始
ko: 설정 시작
zh_hant: 開始設定

# onboarding_done_row_assistant
source: 助手
en: Assistant
ja: アシスタント
ko: 어시스턴트

# onboarding_done_row_name
source: 称呼
en: Name
ja: 呼び名
ko: 호칭
zh_hant: 稱呼

# onboarding_done_row_voice
source: 语音
en: Voice
ja: 音声
ko: 음성
zh_hant: 語音

# onboarding_done_row_voiceover
source: 播报
en: Playback
ja: 読み上げ
ko: 음성 안내
zh_hant: 播報

# onboarding_done_subtitle
source: 进入应用后，请在「设置 → LLM 提供商」保存真实凭据并选择默认模型。
en: Once you're in the app, go to Settings → LLM Providers to save your credentials and choose a default model.
ja: アプリに入ったら、「設定 → LLM プロバイダー」で実際の認証情報を保存し、デフォルトモデルを選択してください。
ko: 앱에 들어간 후 「설정 → LLM 제공업체」에서 실제 자격 증명을 저장하고 기본 모델을 선택해 주세요.
zh_hant: 進入應用後，請在「設定 → LLM 提供商」儲存真實憑據並選擇預設模型。

# onboarding_done_subtitle_detail
source: 进入应用后，请在「设置 → AI 提供商」保存真实凭据并选择默认模型。模型列表会直接来自当前已配置的提供商。
en: After entering the app, save your real credentials and choose a default model under “Settings → AI Providers.” The model list comes directly from your currently configured providers.
ja: アプリに入ったら、「設定 → AI プロバイダー」で実際の認証情報を保存し、デフォルトモデルを選択してください。モデル一覧は現在設定済みのプロバイダーから直接取得されます。
ko: 앱에 들어간 후 「설정 → AI 제공업체」에서 실제 자격 증명을 저장하고 기본 모델을 선택해 주세요. 모델 목록은 현재 설정된 제공업체에서 바로 가져옵니다.
zh_hant: 進入應用後，請在「設定 → AI 提供商」儲存真實憑據並選擇預設模型。模型列表會直接來自當前已配置的提供商。

# onboarding_done_title
source: 基础设置完成
en: Basic Setup Complete
ja: 基本設定が完了しました
ko: 기본 설정 완료
zh_hant: 基礎設定完成

# onboarding_user_placeholder
source: 你的名字
en: Your name
ja: あなたの名前
ko: 이름

# onboarding_user_subtitle
source: 灵犀会用这个名字称呼你，让对话更自然亲切。
en: Lingxi will use this name to address you, making conversations feel more natural.
ja: 灵犀はこの名前であなたを呼び、より自然で親しみやすい会話になります。
ko: 灵犀가 이 이름으로 당신을 부르며, 대화가 더 자연스럽고 친근해집니다.
zh_hant: 靈犀會用這個名字稱呼你，讓對話更自然親切。

# onboarding_user_title
source: 我该怎么称呼你？
en: What should I call you?
ja: あなたのことは何とお呼びすればいいですか？
ko: 어떻게 불러드릴까요?
zh_hant: 我該怎麼稱呼你？

# onboarding_voice_language_ja
source: 日本語
en: Japanese
ko: 일본어

# onboarding_voice_language_system
source: 跟随系统
en: Follow System
ja: システムに従う
ko: 시스템 언어 따름
zh_hant: 跟隨系統

# onboarding_voice_language_zh
source: 中文
en: Chinese
ja: 中国語
ko: 중국어

# onboarding_voice_later
source: 稍后配置
en: Configure Later
ja: 後で設定
ko: 나중에 설정
zh_hant: 稍後配置

# onboarding_voice_no_voices
source: 没有可用声音
en: No voices available
ja: 利用可能な音声がありません
ko: 사용 가능한 음성이 없습니다
zh_hant: 沒有可用聲音

# onboarding_voice_pack_connecting
source: 正在连接 %1$s
en: Connecting %1$s
ja: %1$s に接続しています
ko: %1$s에 연결하는 중
zh_hant: 正在連線 %1$s

# onboarding_voice_pack_download_action
source: 下载 (%1$s)
en: Download (%1$s)
ja: ダウンロード (%1$s)
ko: 다운로드 (%1$s)
zh_hant: 下載 (%1$s)

# onboarding_voice_pack_downloading
source: 正在下载 %1$s
en: Downloading %1$s
ja: %1$s をダウンロード中
ko: %1$s 다운로드 중
zh_hant: 正在下載 %1$s

# onboarding_voice_pack_extracting
source: 正在安装 %1$s
en: Installing %1$s
ja: %1$s をインストール中
ko: %1$s 설치하는 중
zh_hant: 正在安裝 %1$s

# onboarding_voice_pack_extracting_next
source: ，完成后继续下载 %1$s
en: , then continues downloading %1$s
ja: 、完了後に %1$s のダウンロードを続けます
ko: , 완료 후 %1$s 다운로드를 계속합니다
zh_hant: ，完成後繼續下載 %1$s

# onboarding_voice_pack_failed
source: 下载失败（%1$s）：%2$s · 点此重试
en: Download failed (%1$s): %2$s · Tap to retry
ja: ダウンロード失敗（%1$s）：%2$s · タップして再試行
ko: 다운로드 실패 (%1$s): %2$s · 여기를 눌러 다시 시도
zh_hant: 下載失敗（%1$s）：%2$s · 點此重試

# onboarding_voice_pack_queued
source: 等待下载 %1$s
en: Waiting to download %1$s
ja: %1$s のダウンロードを待機中
ko: %1$s 다운로드 대기 중
zh_hant: 等待下載 %1$s

# onboarding_voice_pack_ready
source: ✓ 已下载到本机
en: ✓ Downloaded to this device
ja: ✓ 端末にダウンロード済み
ko: ✓ 기기에 다운로드됨
zh_hant: ✓ 已下載到本機

# onboarding_voice_pack_skip
source: 暂不下载
en: Skip for now
ja: 今はダウンロードしない
ko: 지금은 건너뛰기
zh_hant: 暫不下載

# onboarding_voice_pack_skip_detail
source: 使用系统语音 · 可稍后在设置下载
en: Use the system voice · you can download later in Settings
ja: システム音声を使用 · 後で設定からダウンロード可能
ko: 시스템 음성 사용 · 나중에 설정에서 다운로드 가능
zh_hant: 使用系統語音 · 可稍後在設定下載

# onboarding_voice_pack_subtitle
source: 下载离线语音模型后，听写与朗读完全在本机进行、不依赖网络。可稍后在设置里更换或删除。
en: Once an offline voice model is downloaded, dictation and read-aloud run entirely on-device with no network dependency. You can change or remove it later in Settings.
ja: オフライン音声モデルをダウンロードすると、音声入力と読み上げが完全に端末内で完結し、ネットワークに依存しなくなります。後で設定から変更・削除できます。
ko: 오프라인 음성 모델을 다운로드하면 받아쓰기와 낭독이 완전히 기기 내에서 처리되어 네트워크가 필요 없습니다. 나중에 설정에서 변경하거나 삭제할 수 있습니다.
zh_hant: 下載離線語音模型後，聽寫與朗讀完全在本機進行、不依賴網路。可稍後在設定裡更換或刪除。

# onboarding_voice_pack_title
source: 选择语音包
en: Choose a voice pack
ja: 音声パックを選択
ko: 음성 팩 선택
zh_hant: 選擇語音包

# onboarding_voice_pack_verifying
source: 正在校验 %1$s
en: Verifying %1$s
ja: %1$s を検証中
ko: %1$s 검증하는 중
zh_hant: 正在校驗 %1$s

# onboarding_voice_subtitle
source: 选择识别方式和系统播报声音；心流模式会自动听取并朗读回复。
en: Choose a recognition method and system playback voice; Flow Mode will automatically listen and read replies aloud.
ja: 認識方式とシステムの読み上げ音声を選択してください。心流モードでは自動的に聞き取り、返信を読み上げます。
ko: 인식 방식과 시스템 음성 안내를 선택하세요. 심리스 모드에서는 자동으로 듣고 응답을 읽어 줍니다.
zh_hant: 選擇識別方式和系統播報聲音；心流模式會自動聽取並朗讀回覆。

# onboarding_voice_title
source: 配置语音能力
en: Set Up Voice
ja: 音声機能を設定
ko: 음성 기능 설정
zh_hant: 配置語音能力

# onboarding_voice_voice_title
source: 系统播报声音
en: System Playback Voice
ja: システムの読み上げ音声
ko: 시스템 음성 안내
zh_hant: 系統播報聲音

# onboarding_voiceprint_sample_phrase
source: 「你好灵犀，我是%1$s。」
en: “Hello Lingxi, I'm %1$s.”
ja: 「こんにちは灵犀、%1$sです。」
ko: 「안녕 灵犀, 나는 %1$s이야.」
zh_hant: 「你好靈犀，我是%1$s。」

# onboarding_voiceprint_self_pronoun
source: 我
en: me
ja: 私
ko: 나

# onboarding_voiceprint_status_done
source: ✓ 声纹已录入
en: ✓ Voiceprint recorded
ja: ✓ 声紋を登録しました
ko: ✓ 음성 지문이 등록되었습니다
zh_hant: ✓ 聲紋已錄入

# onboarding_voiceprint_status_idle
source: 轻点麦克风，朗读下面这句话
en: Tap the microphone and read the sentence below aloud
ja: マイクをタップして、以下の文を読み上げてください
ko: 마이크를 탭하고 아래 문장을 읽어 주세요
zh_hant: 輕點麥克風，朗讀下面這句話

# onboarding_voiceprint_status_recording
source: 正在聆听你的声音… %1$d%
en: Listening to your voice… %1$d%
ja: あなたの声を聞き取っています… %1$d%
ko: 당신의 목소리를 듣는 중… %1$d%
zh_hant: 正在聆聽你的聲音… %1$d%

# onboarding_voiceprint_subtitle
source: 让灵犀听声识人，只对你的声音响应、唤起属于你的记忆。可稍后在设置里完成。
en: Let Lingxi recognize you by voice, responding only to your voice and recalling memories that belong to you. You can finish this later in Settings.
ja: 灵犀があなたの声を覚え、あなたの声にのみ反応してあなた専用の記憶を呼び起こします。後で設定から完了することもできます。
ko: 灵犀가 목소리로 당신을 알아보게 하세요. 당신의 목소리에만 반응하고 당신만의 기억을 불러옵니다. 나중에 설정에서 완료할 수도 있습니다.
zh_hant: 讓靈犀聽聲識人，只對你的聲音響應、喚起屬於你的記憶。可稍後在設定裡完成。

# onboarding_voiceprint_title
source: 录入你的声纹
en: Record your voiceprint
ja: 声紋を登録
ko: 음성 지문 등록
zh_hant: 錄入你的聲紋

# onboarding_wake_word_preview
source: 嘿，%1$s
en: Hey, %1$s
ja: ねえ、%1$s
ko: 헤이, %1$s

# onboarding_welcome_subtitle
source: 花一分钟，让它认识你——之后你只需开口，它就会回应。
en: Spend a minute getting acquainted — after that, just speak, and it'll respond.
ja: 1 分だけ時間をかけて、灵犀にあなたのことを知ってもらいましょう。あとは話しかけるだけで応えてくれます。
ko: 1분만 시간을 내어 灵犀가 당신을 알게 해주세요 — 그다음부터는 말만 하면 응답합니다.
zh_hant: 花一分鐘，讓它認識你——之後你只需開口，它就會回應。

# onboarding_welcome_title
source: 欢迎使用灵犀
en: Welcome to Lingxi
ja: 灵犀へようこそ
ko: 灵犀에 오신 것을 환영합니다
zh_hant: 歡迎使用靈犀

# oss_android_bundle_body
source: 本 Android 组合产品按 GNU GPLv3 分发。原有 MIT、Apache、LGPL 及 Alpine 软件包继续保留各自声明。构建产物同时携带 NOTICE、SPDX SBOM、固定摘要和对应源码信息。
en: This Android bundle is distributed under the GNU GPLv3. The original MIT, Apache, LGPL, and Alpine packages retain their own license notices. Build artifacts include a NOTICE file, SPDX SBOM, pinned checksums, and corresponding source information.
ja: この Android 統合製品は GNU GPLv3 の下で配布されます。元の MIT、Apache、LGPL、および Alpine パッケージは、それぞれの表示を引き続き保持します。ビルド成果物には NOTICE、SPDX SBOM、固定ダイジェスト、対応ソースコード情報が含まれます。
ko: 이 Android 번들 제품은 GNU GPLv3에 따라 배포됩니다. 기존 MIT, Apache, LGPL 및 Alpine 패키지는 각자의 라이선스 조항을 그대로 유지합니다. 빌드 결과물에는 NOTICE, SPDX SBOM, 고정된 다이제스트 및 해당 소스 코드 정보가 함께 포함됩니다.
zh_hant: 本 Android 組合產品按 GNU GPLv3 分發。原有 MIT、Apache、LGPL 及 Alpine 軟體包繼續保留各自宣告。建置產物同時攜帶 NOTICE、SPDX SBOM、固定摘要和對應原始碼資訊。

# oss_android_bundle_title
source: Android 组合发行物
en: Android Combined Distribution
ja: Android 統合配布物
ko: Android 번들 배포물
zh_hant: Android 組合發行物

# oss_license_alpine_packages
source: 各软件包许可证（清单和 SBOM 随发行物提供）
en: Per-package licenses (manifest and SBOM included with the distribution)
ja: 各パッケージのライセンス（一覧と SBOM は配布物に同梱）
ko: 각 패키지별 라이선스 (목록과 SBOM은 배포물에 함께 제공됨)
zh_hant: 各軟體包許可證（清單和 SBOM 隨發行物提供）

# oss_license_proot
source: GPL-2.0-or-later（本组合选择 GPLv3）
en: GPL-2.0-or-later (this bundle uses GPLv3)
ja: GPL-2.0-or-later（本統合物では GPLv3 を選択）
ko: GPL-2.0-or-later (이 번들에서는 GPLv3를 선택함)
zh_hant: GPL-2.0-or-later（本組合選擇 GPLv3）

# oss_offer_note
source: 若应用内链接暂时不可用，请以发行包内 NOTICE 与 SBOM 所列固定版本、哈希和源码地址为准。
en: If the in-app link is temporarily unavailable, refer to the pinned versions, hashes, and source URLs listed in the NOTICE and SBOM inside the distribution package.
ja: アプリ内のリンクが一時的に利用できない場合は、配布パッケージ内の NOTICE と SBOM に記載された固定バージョン、ハッシュ、ソースコードの所在地を正としてください。
ko: 앱 내 링크를 일시적으로 사용할 수 없는 경우, 배포 패키지에 포함된 NOTICE 및 SBOM에 명시된 고정 버전, 해시, 소스 코드 주소를 기준으로 해주세요.
zh_hant: 若應用內連結暫時不可用，請以發行包內 NOTICE 與 SBOM 所列固定版本、雜湊和原始碼地址為準。

# oss_view_source
source: 查看对应源码
en: View Corresponding Source
ja: 対応ソースコードを見る
ko: 해당 소스 코드 보기
zh_hant: 檢視對應原始碼

# permission_allow
source: 允许
en: Allow
ja: 許可
ko: 허용
zh_hant: 允許

# permission_allow_always
source: 始终允许
en: Always Allow
ja: 常に許可
ko: 항상 허용
zh_hant: 始終允許

# permission_allow_once
source: 允许一次
en: Allow once
ja: 1 回だけ許可
ko: 한 번 허용
zh_hant: 允許一次

# permission_allow_tool
source: 允许 %1$s？
en: Allow %1$s?
ja: %1$s を許可しますか？
ko: %1$s을(를) 허용하시겠습니까?
zh_hant: 允許 %1$s？

# permission_allow_tool %@
source: 允许 %@？
en: Allow %@?
ja: %@ を許可しますか？
ko: %@을(를) 허용하시겠습니까?
zh_hant: 允許 %@？

# permission_bypass_confirmation_detail
source: 智能体将不再就后续操作征求确认。
en: The agent will no longer ask for confirmation before taking further actions.
ja: 以後、Agent は操作の確認を求めなくなります。
ko: 에이전트가 이후 작업에 대해 더 이상 확인을 요청하지 않습니다.
zh_hant: Agent 將不再就後續操作徵求確認。

# permission_bypass_confirmation_title
source: 启用免确认模式？
en: Turn on confirmation-free mode?
ja: 確認不要モードを有効にしますか？
ko: 확인 없이 실행 모드를 켜시겠습니까?
zh_hant: 啟用免確認模式？

# permission_bypass_mode_title
source: 开启免确认（绕过权限）模式？
en: Turn on no-confirmation (bypass permissions) mode?
ja: 確認不要（権限バイパス）モードをオンにしますか？
ko: 확인 없이 실행(권한 우회) 모드를 켜시겠습니까?
zh_hant: 開啟免確認（繞過權限）模式？

# permission_deny
source: 拒绝
en: Deny
ja: 拒否
ko: 거부
zh_hant: 拒絕

# permission_exit_plan_mode
source: 退出计划模式并继续？
en: Exit plan mode and continue?
ja: プランモードを終了して続行しますか？
ko: 계획 모드를 종료하고 계속하시겠습니까?
zh_hant: 退出計劃模式並繼續？

# permission_request_title
source: 请求权限
en: Permission Request
ja: 権限のリクエスト
ko: 권한 요청
zh_hant: 請求權限

# project_conflict_defer_button
source: 稍后处理
en: Decide Later
ja: 後で処理
ko: 나중에 처리
zh_hant: 稍後處理

# project_conflict_dialog_body
source: 默认已跳过冲突文件。请选择全部保留本机版本或外部目录版本。
en: Conflicting files were skipped by default. Choose to keep all local versions or all external versions.
ja: 競合したファイルはデフォルトでスキップされています。すべて端末内バージョンを保持するか、外部ディレクトリバージョンを保持するかを選択してください。
ko: 기본적으로 충돌한 파일은 건너뜁니다. 기기 버전 또는 외부 디렉터리 버전 중 하나를 모두 유지하도록 선택해 주세요.
zh_hant: 預設已跳過衝突檔案。請選擇全部保留本機版本或外部目錄版本。

# project_conflict_dialog_more_files_fmt
source: 还有 %1$d 个文件…
en: %1$d more files…
ja: 他に %1$d 件のファイル…
ko: %1$d개 파일 더 있음…
zh_hant: 還有 %1$d 個檔案…

# project_conflict_dialog_title_fmt
source: 发现 %1$d 个同步冲突
en: Found %1$d sync conflicts
ja: %1$d 件の同期競合が見つかりました
ko: 동기화 충돌 %1$d개 발견
zh_hant: 發現 %1$d 個同步衝突

# project_conflict_keep_external_button
source: 保留外部
en: Keep External
ja: 外部を保持
ko: 외부 버전 유지

# project_conflict_keep_internal_button
source: 保留本机
en: Keep Local
ja: 端末内を保持
ko: 기기 버전 유지
zh_hant: 保留本機

# project_corrupt_projects_message_fmt
source: %1$d 个项目数据损坏或路径异常，已隔离；其他项目仍可使用。
en: %1$d project(s) had corrupted data or an invalid path and were quarantined; other projects remain usable.
ja: %1$d 件のプロジェクトデータが破損またはパスに異常があるため、隔離しました。他のプロジェクトは引き続き利用できます。
ko: 프로젝트 %1$d개의 데이터가 손상되었거나 경로에 문제가 있어 격리되었습니다. 다른 프로젝트는 계속 사용할 수 있습니다.
zh_hant: %1$d 個專案資料損壞或路徑異常，已隔離；其他專案仍可使用。

# project_creating_message
source: 正在创建项目…
en: Creating project…
ja: プロジェクトを作成中…
ko: 프로젝트를 만드는 중…
zh_hant: 正在建立專案…

# project_dialog_create_body
source: 项目使用稳定 UUID 保存；名称不会成为文件夹路径。
en: Projects are saved with a stable UUID; the name never becomes the folder path.
ja: プロジェクトは固定の UUID で保存されます。名前がフォルダのパスになることはありません。
ko: 프로젝트는 고유한 UUID로 저장됩니다. 이름은 폴더 경로가 되지 않습니다.
zh_hant: 專案使用穩定 UUID 儲存；名稱不會成為資料夾路徑。

# project_dialog_create_internal_button
source: 创建本机项目
en: Create Local Project
ja: 端末内プロジェクトを作成
ko: 기기 내 프로젝트 만들기
zh_hant: 建立本機專案

# project_dialog_create_title
source: 新建项目
en: New Project
ja: 新しいプロジェクト
ko: 새 프로젝트
zh_hant: 新建專案

# project_dialog_import_external_button
source: 导入外部目录
en: Import External Directory
ja: 外部ディレクトリをインポート
ko: 외부 디렉터리 가져오기
zh_hant: 匯入外部目錄

# project_error_dialog_title
source: 项目操作失败
en: Project Operation Failed
ja: プロジェクト操作に失敗しました
ko: 프로젝트 작업 실패
zh_hant: 專案操作失敗

# project_exporting_message
source: 正在同步回外部目录…
en: Syncing back to external directory…
ja: 外部ディレクトリへ同期中…
ko: 외부 디렉터리로 동기화하는 중…
zh_hant: 正在同步回外部目錄…

# project_importing_message
source: 正在导入外部目录…
en: Importing external directory…
ja: 外部ディレクトリをインポート中…
ko: 외부 디렉터리를 가져오는 중…
zh_hant: 正在匯入外部目錄…

# project_loading_message
source: 正在读取项目…
en: Loading projects…
ja: プロジェクトを読み込み中…
ko: 프로젝트를 불러오는 중…
zh_hant: 正在讀取專案…

# project_reauthorizing_message
source: 正在重新授权并导入…
en: Reauthorizing and importing…
ja: 再承認してインポート中…
ko: 다시 권한을 부여하고 가져오는 중…
zh_hant: 正在重新授權並匯入…

# project_reimporting_message
source: 正在从外部目录重新导入…
en: Re-importing from external directory…
ja: 外部ディレクトリから再インポート中…
ko: 외부 디렉터리에서 다시 가져오는 중…
zh_hant: 正在從外部目錄重新匯入…

# project_relative_time_just_now
source: 刚刚
en: Just now
ja: たった今
ko: 방금
zh_hant: 剛剛

# project_resolving_conflicts_message
source: 正在解决同步冲突…
en: Resolving sync conflicts…
ja: 同期の競合を解決中…
ko: 동기화 충돌을 해결하는 중…
zh_hant: 正在解決同步衝突…

# project_switch_failed_message %@
source: 项目切换失败：%@
en: Failed to switch project: %@
ja: プロジェクトの切り替えに失敗しました：%@
ko: 프로젝트 전환 실패: %@
zh_hant: 專案切換失敗：%@

# project_switching_message
source: 正在切换项目…
en: Switching project…
ja: プロジェクトを切り替えています…
ko: 프로젝트를 전환하는 중…
zh_hant: 正在切換專案…

# project_sync_in_progress_notice
source: 项目正在同步，请等待同步完成。
en: The project is syncing. Please wait for it to finish.
ja: プロジェクトを同期しています。同期が完了するまでお待ちください。
ko: 프로젝트가 동기화 중입니다. 동기화가 끝날 때까지 기다려 주세요.
zh_hant: 專案正在同步，請等待同步完成。

# project_sync_state_auth_lost
source: 外部目录授权失效
en: External folder authorization lost
ja: 外部ディレクトリの許可が無効になりました
ko: 외부 디렉터리 권한 만료됨
zh_hant: 外部目錄授權失效

# project_sync_state_conflict
source: 存在同步冲突
en: Sync conflict
ja: 同期の競合があります
ko: 동기화 충돌 있음
zh_hant: 存在同步衝突

# project_sync_state_error
source: 同步失败
en: Sync failed
ja: 同期失敗
ko: 동기화 실패
zh_hant: 同步失敗

# project_sync_state_local
source: 本机
en: Local only
ja: 端末内
ko: 기기
zh_hant: 本機

# project_sync_state_pending
source: 有待同步更改
en: Changes pending sync
ja: 同期待ちの変更があります
ko: 동기화 대기 중인 변경 사항 있음

# project_sync_state_synced
source: 已同步
en: Synced
ja: 同期済み
ko: 동기화됨

# project_sync_state_syncing
source: 同步中
en: Syncing
ja: 同期中
ko: 동기화 중

# project_sync_stop_task_first_notice
source: 请先停止当前任务，再同步项目。
en: Stop the current task before syncing the project.
ja: プロジェクトを同期する前に、現在のタスクを停止してください。
ko: 프로젝트를 동기화하기 전에 현재 작업을 먼저 중지해 주세요.
zh_hant: 請先停止當前任務，再同步專案。

# provider_add_kind %@
source: 添加%@
en: Add %@
ja: %@を追加
ko: %@ 추가
zh_hant: 新增%@

# provider_add_kind_fmt
source: 添加%1$s
en: Add %1$s
ja: %1$sを追加
ko: %1$s 추가
zh_hant: 新增%1$s

# provider_fetch_blurb
source: 抓取网页正文用于阅读、摘要、引用 — 推荐 Jina Reader（免费）。
en: Fetches web page content for reading, summarizing, and citing — Jina Reader (free) is recommended.
ja: ウェブページの本文を取得して、読み込み・要約・引用に利用します — Jina Reader（無料）がおすすめです。
ko: 웹 페이지 본문을 가져와 읽기, 요약, 인용에 사용합니다 — Jina Reader(무료)를 추천합니다.
zh_hant: 抓取網頁正文用於閱讀、摘要、引用 — 推薦 Jina Reader（免費）。

# provider_llm_blurb
source: 灵犀本身不调用云端 LLM — 由你添加的提供商完成推理。密钥仅本机加密。
en: Lingxi doesn't call any cloud LLM on its own — inference is handled by the providers you add. Keys are encrypted locally only.
ja: 灵犀自体はクラウド LLM を呼び出しません — 推論はあなたが追加したプロバイダーが行います。API キーは端末内で暗号化して保存されます。
ko: 灵犀는 클라우드 LLM을 직접 호출하지 않으며, 추가한 제공업체가 추론을 수행합니다. 키는 기기에서만 암호화되어 저장됩니다.
zh_hant: 靈犀本身不呼叫雲端 LLM — 由你新增的提供商完成推理。金鑰僅本機加密。

# provider_no_providers_added
source: 尚未添加任何提供商
en: No providers added yet
ja: プロバイダーはまだ追加されていません
ko: 아직 추가된 제공업체가 없습니다
zh_hant: 尚未新增任何提供商

# provider_search_blurb
source: 让 AI 接入实时网页搜索 — 选择一个搜索提供商以启用"联网"模式。
en: Give the AI real-time web search — choose a search provider to enable "Web" mode.
ja: AI にリアルタイムのウェブ検索を接続します — 検索プロバイダーを選択すると「ネット接続」モードが有効になります。
ko: AI가 실시간 웹 검색에 접근하도록 하려면 검색 제공업체를 선택해 "웹 검색" 모드를 활성화하세요.
zh_hant: 讓 AI 接入實時網頁搜尋 — 選擇一個搜尋提供商以啟用"聯網"模式。

# session_index_save_failed_fmt
source: 会话索引保存失败：%1$s
en: Failed to save session index: %1$s
ja: 会話インデックスの保存に失敗しました：%1$s
ko: 세션 인덱스 저장 실패: %1$s
zh_hant: 會話索引儲存失敗：%1$s

# session_index_save_new_failed_fmt
source: 新会话索引保存失败：%1$s
en: Failed to save new session index: %1$s
ja: 新しい会話インデックスの保存に失敗しました：%1$s
ko: 새 세션 인덱스 저장 실패: %1$s
zh_hant: 新會話索引儲存失敗：%1$s

# session_relative_days_ago_fmt
source: %1$d 天前
en: %1$d days ago
ja: %1$d 日前
ko: %1$d일 전

# session_relative_hours_ago_fmt
source: %1$d 小时前
en: %1$d hr ago
ja: %1$d 時間前
ko: %1$d시간 전
zh_hant: %1$d 小時前

# session_relative_minutes_ago_fmt
source: %1$d 分钟前
en: %1$d min ago
ja: %1$d 分前
ko: %1$d분 전
zh_hant: %1$d 分鐘前

# session_relative_month_day_fmt
source: %1$d月%2$d日
en: %1$d/%2$d
ko: %1$d월 %2$d일

# session_relative_yesterday
source: 昨天
en: Yesterday
ja: 昨日
ko: 어제

# session_untitled
source: 未命名会话
en: Untitled Session
ja: 無題の会話
ko: 제목 없는 대화
zh_hant: 未命名會話

# settings_accent_amber
source: 琥珀
en: Amber
ja: アンバー
ko: 앰버

# settings_accent_brick
source: 砖红
en: Brick Red
ja: ブリック
ko: 브릭
zh_hant: 磚紅

# settings_accent_cyan
source: 青蓝
en: Cyan
ja: シアン
ko: 시안
zh_hant: 青藍

# settings_accent_indigo
source: 靛紫
en: Indigo
ja: インディゴ
ko: 인디고

# settings_accent_rose
source: 玫红
en: Rose
ja: ローズ
ko: 로즈
zh_hant: 玫紅

# settings_accent_teal
source: 青绿
en: Teal
ja: ティール
ko: 틸
zh_hant: 青綠

# settings_account
source: 账户
en: Account
ja: アカウント
ko: 계정
zh_hant: 帳戶

# settings_account_pro_renewal
source: Pro · 续费日 2026-09-30
en: Pro · Renews 2026-09-30
ja: Pro・更新日 2026-09-30
ko: Pro · 갱신일 2026-09-30
zh_hant: Pro · 續費日 2026-09-30

# settings_api_url
source: API 地址
en: API URL
ja: API アドレス
ko: API 주소

# settings_app_ask_question
source: 向灵犀提问
en: Ask Lingxi
ja: 灵犀に質問する
ko: 灵犀에게 질문하기
zh_hant: 向靈犀提問

# settings_app_ask_question_detail
source: 接收 Siri 或其他 App 传入的文本
en: Receive text passed in from Siri or other apps
ja: Siri や他のアプリから渡されたテキストを受け取ります
ko: Siri나 다른 앱에서 전달된 텍스트를 받습니다
zh_hant: 接收 Siri 或其他 App 傳入的文字

# settings_app_integration
source: 应用接入
en: App Integrations
ja: アプリ連携
ko: 앱 연동
zh_hant: 應用接入

# settings_app_integration_actions
source: 3 个动作
en: 3 actions
ja: 3 個のアクション
ko: 3개 동작
zh_hant: 3 個動作

# settings_app_integration_sub
source: Siri · 快捷指令 · 自动化
en: Siri · Shortcuts · Automation
ja: Siri・ショートカット・オートメーション
ko: Siri · 단축어 · 자동화
zh_hant: Siri · 快捷指令 · 自動化
